app/controllers/admin/gists_controller.rb

SELECT "gists".* FROM "gists"
---
    def index
      @gists = Gist.all