app/controllers/admin/questions_controller.rb

  def find_test
    @test = Test.find(params[:test_id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]