app/controllers/admin/tests_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 4]]
---
    def show
      @questions = @test.questions.includes(:answers)

INSERT INTO "tests" ("title", "level", "category_id", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "o"], ["level", 1], ["category_id", 1], ["creator_id", 24], ["created_at", "2024-09-01 09:04:09.144621"], ["updated_at", "2024-09-01 09:04:09.144621"]]
---
    def create
      @test = Test.new(test_params)
      @test.creator = current_user
      if @test.save
        redirect_to admin_tests_path,
                    notice: t('admin.tests.created')

SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_test
      @test = Test.find(params[:id])