app/controllers/feedbacks_controller.rb

  def create
    @feedback = Feedback.new(feedback_params)
    assign_user

    if @feedback.save
---
INSERT INTO "feedbacks" ("name", "email", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asd"], ["email", "amsaks@yandex.by"], ["message", "sddfdsffdsfds"], ["created_at", "2024-08-25 09:00:35.373298"], ["updated_at", "2024-08-25 09:00:35.373298"]]