app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "amsak@yandex.by"], ["LIMIT", 1]]