app/controllers/tests_controller.rb

  def find_test
    @test = Test.find(params[:id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]