app/controllers/test_passages_controller.rb

  def update
    @test_passage.accept!(params[:answer_ids])

    if time_expired?
      flash[:alert] = t('test_passages.update.time_expired')
---
UPDATE "test_passages" SET "current_question_id" = $1, "updated_at" = $2 WHERE "test_passages"."id" = $3  [["current_question_id", 41], ["updated_at", "2024-08-25 12:07:03.368005"], ["id", 11]]

  def find_test_passage
    @test_passage = TestPassage.find(params[:id])
---
SELECT "test_passages".* FROM "test_passages" WHERE "test_passages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]