app/models/answer.rb

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
---
  def limit_answers
    errors.add(:base, 'Maximum 4 answers for 1 question') if question.answers.count >= 4