app/models/test_passage.rb

  def questions_count
    test.questions.count
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 16]]

  def before_validation_set_first_question
    if current_question.nil?
      self.current_question = test.questions.first if test.present?
---
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = $1 ORDER BY "questions"."id" ASC LIMIT $2  [["test_id", 1], ["LIMIT", 1]]

  def next_question
    test.questions.order(:id).where('id > ?', current_question.id).first
---
SELECT "questions".* FROM "questions" WHERE "questions"."test_id" = $1 AND (id > 1) ORDER BY "questions"."id" ASC LIMIT $2  [["test_id", 1], ["LIMIT", 1]]
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]