app/views/admin/tests/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."title" ASC
---
    <%= form.label :category_id, class: "form-label" %>
    <%= form.collection_select :category_id,
                               Category.sort_by_title,
                               :id,
                               :title,
                               { prompt: t('admin.tests.select_category') },
                               class: "form-select" %>