app/views/admin/tests/index.html.erb

SELECT "tests".* FROM "tests"
---
        <th><%= t('tests.index.duration') %></th>
        <th><%= t('tests.index.count') %></th>