app/views/tests/_test.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = $1  [["test_id", 4]]
---
  <td><%= test_level(test) %></td>
  <td><%= test.questions.count %></td>